export type HorseStatus = 'fund' | 'private' | 'memory';

export interface Horse {
  id: string;
  name: string;
  age: string;
  status: HorseStatus;
  photo: string;
  heroPhoto: string;
  additionalPhotos: string[];
  shortBio: string;
  rescueStory: string;
}

export const horses: Horse[] = [
  {
    id: 'bojevaja',
    name: 'Бойова',
    age: '2006–2026',
    status: 'memory',
    photo: '/horse-rescue-web/images/bojevaja.jpg',
    heroPhoto: '/horse-rescue-web/images/bojevaja.jpg',
    additionalPhotos: [],
    shortBio: 'Мати Брітні',
    rescueStory: `Ще зовсім маленькою вона мала загинути на бійні та саме тоді Боєву викупили до міського прокату. На жаль, багато таких місць відомі своїми жорстокими умовами та ставленням до тварин, яких змушують працювати на межі можливостей і без належної уваги здоров’ю. Ця історія не стала винятком. П’ятнадцять років роботи відгукнулися Бойовій проблемами зі спиною, ногами та різного роду запаленнями.

До нас вона потрапила в свої 17: лікуватися, повертали сили, наново вчитися довіряти людям та доживати свою старість в спокою та безпеці. Хоча б трошки їй дійсно вдалося відпочити.

Проте, життя, як ми знаємо, буває досить несправедливим. Під час обстрілу неподалік від конюшні Бойова отримала важкі опіки, а лікування та переливання крові не дало очікуванного результату.
Вона не вижила.

Останні дні свого життя Бойова провела біля людей, які про неї піклувалися та дійсно любили. Ця історія залишиться не лише шрамом на наших серцях, але й важливим нагадуванням про те, навіщо і чому ми продовжуємо нашу справу.`,
  },

   {
    id: 'kalibri',
    name: 'Калібрі',
    age: 'Рік народження: 2026',
    status: 'fund',
    photo: '/horse-rescue-web/images/kalibri.jpg',
    heroPhoto: '/horse-rescue-web/images/kalibri.jpg',
    additionalPhotos: ['/horse-rescue-web/images/kalibri2.jpg'],
    shortBio: 'Лоша Брітні',
    rescueStory:
      `Народилася на нашій фермі :)`,
  },

  {
    id: 'britni',
    name: 'Брітні',
    age: 'Рік народження: 2017',
    status: 'fund',
    photo: '/horse-rescue-web/images/brit.jpg',
    heroPhoto: '/horse-rescue-web/images/brit.jpg',
    additionalPhotos: [],
    shortBio: 'Лоша Бойової',
    rescueStory:
      `Доля Брітні частково нагадує долю її матері: важка робота в міському прокаті, що спричинила проблеми зі здоров’ям - хворі суглоби; бетонні підлоги та металеві огородження холодного утилітарного приміщення - бійні; стресові роди (хоча, на відміну від матері, перші пологи Брітні пройшли в окупації).

      7 місяців, 3 роки, 4 роки - вік, коли голові нашого табуна Брітні довелося пережити ці життєві події.
      `,
  },

  {
    id: 'bagira',
    name: 'Багіра',
    age: 'Рік народження: 2022',
    status: 'fund',
    photo: '/horse-rescue-web/images/bagira.jpg',
    heroPhoto: '/horse-rescue-web/images/bagira.jpg',
    additionalPhotos: [],
    shortBio: 'Лоша Брітні',
    rescueStory:
      `Якщо вірити гуглу, відомий політичний філософ Джон Ролз одного разу сказав: "Ми маємо передати майбутнім поколінням не менше, ніж отримали самі. А бажано навіть більше". Думаю, ця фраза відмінно підходить Багірі та її родоводу.

      Народжена в окупації, з перших моментів свого життя вона була оточена трепетною турботою та любов’ю. Шляхетна спадкоємиця, дочка своєї матері, вона займає роль глави табуна у відсутність Брітні.
      `,
  },

    {
    id: 'furioza',
    name: 'Фуріоза',
    age: 'Рік народження: невідомий',
    status: 'fund',
    photo: '/horse-rescue-web/images/furioza.jpg',
    heroPhoto: '/horse-rescue-web/images/furioza.jpg',
    additionalPhotos: [],
    shortBio: 'Мати Лекси',
    rescueStory:
      `Світ, безумовно, неосяжний і контрастний: одночасно десь зриваються відчайдушними хрипами невинні життя, в інших же місцях - б’ються бадьорим ритмом серця ще ненароджених. 
      
      В той день вагітну Фуріозу мали забити на бійні. Моторошна, трагічна подія - без краплі жалю забрати два життя лише одним ударом сокири. Подія, що не залишила людей байдужими. 
      
      У найкоротші сроки вдалося зібрати необхідну суму та вирвати кобилу із гострих лап м'ясника. Так на нашій фермі з’явилися Фуріоза (яку на фермі ми кличемо просто - Мати) і Лекса (улюблене Мамине лоша).

      Ми щиро дякуємо усім небайдужим серцям із с. Віта Поштова, які долучилися до збору, що зробив викуп можливим! 
      З любов’ю, Free Horses
      `,
  },

   {
    id: 'leksa',
    name: 'Лекса',
    age: 'Рік народження: 2026',
    status: 'fund',
    photo: '/horse-rescue-web/images/leksa.jpg',
    heroPhoto: '/horse-rescue-web/images/leksa.jpg',
    additionalPhotos: [],
    shortBio: 'Лоша Фуріози',
    rescueStory:
      `Лекса народилася на нашій фермі. Її мама, Фуріоза, приїхала до нас вагітною - її вдалося викупити з бійні завдяки спільним зусиллям Лізи та жителів с. Віта Поштова.
      
      Так Лекса отримала те, чого могло не бути в її житті, - шанс народитися у безпеці та з турботою поруч. Сьогодні вона росте разом із мамою, добре їсть, грається, пізнає світ і просто насолоджується кінським життям.

      За нею доглядають, стежать за її здоров’ям і дають їй головне - можливість рости без страху та поспіху. Лекса - маленьке нагадування про те, що порятунок однієї тварини може подарувати життя ще одній.`,
  },

  {
    id: 'vavilon',
    name: 'Вавілон',
    age: 'Рік народження: 2024',
    status: 'fund',
    photo: '/horse-rescue-web/images/vavilon.jpg',
    heroPhoto: '/horse-rescue-web/images/vavilon.jpg',
    additionalPhotos: ['/horse-rescue-web/images/vavilon-bulan.jpg'],
    shortBio: 'Маленький, який боявся всього',
    rescueStory:
      `Він потрапив до нас зовсім маленьким - усього в п’ять місяців. Від страху перед іншими кіньми малюк міг навіть битися зубами об стіну, коли хтось підходив його понюхати. Одного разу, коли до нього прийшли знайомитися, він так злякався, що навіть виламав електропастух.
       Та з часом він знайшов своє місце поруч із нашим приватним жеребцем. І сталося несподіване: жеребець, який зазвичай ганяє старших хлопців, знайшов спільну мову з лошам, яке боїться майже всього.
       Зараз Вавілон поступово вчиться спілкуватися з іншими кіньми, стає впевненішим і пізнає світ без страху. Але один фаворит у нього все ще залишається - його старший друг.`,
  },
  
  {
    id: 'bulan',
    name: 'Булан',
    age: 'Рік народження: 2023',
    status: 'private',
    photo: '/horse-rescue-web/images/bulan.jpg',
    heroPhoto: '/horse-rescue-web/images/bulan.jpg',
    additionalPhotos: ['/horse-rescue-web/images/vavilon-bulan.jpg'],
    shortBio: 'Найкращій друг Вавілона',
    rescueStory:
      `Булан - приватний мешканець нашої ферми. Його історія не про порятунок чи важке минуле, а про життя, у якому є турбота, безпека та правильне оточення.
       Він живе поруч із кіньми фонду, отримує належний догляд, ветеринарне обслуговування, якісне харчування та увагу. Для нас важливо, щоб кожен кінь поруч із нами - незалежно від його історії - мав можливість жити добре.`,
  },

  {
    id: 'sparta',
    name: 'Спарта',
    age: 'Рік народження: невідомий',
    status: 'private',
    photo: '/horse-rescue-web/images/sparta.jpg',
    heroPhoto: '/horse-rescue-web/images/sparta.jpg',
    additionalPhotos: [''],
    shortBio: 'Не всі історії можна розповісти',
    rescueStory:
      `Це приватний кінь, який живе на території нашої ферми разом із підопічними фонду.  
       На нашій фермі живуть не лише коні, які безпосередньо належать фонду. Ми також допомагаємо приватним власникам, чиї коні потребують безпечного місця, відновлення та реабілітації - зокрема тим, кого вдалося вивезти з прифронтових та небезпечних територій.
       Деякі з них приїхали до нас у дуже важкому стані, інші потребували меншої допомоги. Але кожному ми намагаємося дати необхідне: спокійне середовище, ветеринарний супровід, відновлення, якісний догляд і час.
       Історіями приватних коней ми не ділимося детально - поважаємо приватність їхніх власників. Для нас допомога не закінчується на тих, хто офіційно є підопічним фонду. Якщо кінь потребує безпеки та турботи - ми намагаємося бути поруч.`,
  },

  {
    id: 'djo',
    name: 'Джо',
    age: 'Рік народження: невідомий',
    status: 'private',
    photo: '/horse-rescue-web/images/djo.jpg',
    heroPhoto: '/horse-rescue-web/images/djo.jpg',
    additionalPhotos: [''],
    shortBio: 'Не всі історії можна розповісти',
    rescueStory:
      `Це приватний кінь, який живе на території нашої ферми разом із підопічними фонду.  
       На нашій фермі живуть не лише коні, які безпосередньо належать фонду. Ми також допомагаємо приватним власникам, чиї коні потребують безпечного місця, відновлення та реабілітації - зокрема тим, кого вдалося вивезти з прифронтових та небезпечних територій.
       Деякі з них приїхали до нас у дуже важкому стані, інші потребували меншої допомоги. Але кожному ми намагаємося дати необхідне: спокійне середовище, ветеринарний супровід, відновлення, якісний догляд і час.
       Історіями приватних коней ми не ділимося детально - поважаємо приватність їхніх власників. Для нас допомога не закінчується на тих, хто офіційно є підопічним фонду. Якщо кінь потребує безпеки та турботи - ми намагаємося бути поруч.`,
  },

  {
    id: 'lada',
    name: 'Лада',
    age: 'Рік народження: невідомий',
    status: 'private',
    photo: '/horse-rescue-web/images/lada.jpg',
    heroPhoto: '/horse-rescue-web/images/lada.jpg',
    additionalPhotos: [''],
    shortBio: 'Не всі історії можна розповісти',
    rescueStory:
      `Це приватний кінь, який живе на території нашої ферми разом із підопічними фонду.  
       На нашій фермі живуть не лише коні, які безпосередньо належать фонду. Ми також допомагаємо приватним власникам, чиї коні потребують безпечного місця, відновлення та реабілітації - зокрема тим, кого вдалося вивезти з прифронтових та небезпечних територій.
       Деякі з них приїхали до нас у дуже важкому стані, інші потребували меншої допомоги. Але кожному ми намагаємося дати необхідне: спокійне середовище, ветеринарний супровід, відновлення, якісний догляд і час.
       Історіями приватних коней ми не ділимося детально - поважаємо приватність їхніх власників. Для нас допомога не закінчується на тих, хто офіційно є підопічним фонду. Якщо кінь потребує безпеки та турботи - ми намагаємося бути поруч.`,
  },

    {
    id: 'bonya',
    name: 'Боня',
    age: 'Рік народження: невідомий',
    status: 'private',
    photo: '/horse-rescue-web/images/bonya.jpg',
    heroPhoto: '/horse-rescue-web/images/bonya.jpg',
    additionalPhotos: [''],
    shortBio: 'Не всі історії можна розповісти',
    rescueStory:
      `Це приватний кінь, який живе на території нашої ферми разом із підопічними фонду.  
       На нашій фермі живуть не лише коні, які безпосередньо належать фонду. Ми також допомагаємо приватним власникам, чиї коні потребують безпечного місця, відновлення та реабілітації - зокрема тим, кого вдалося вивезти з прифронтових та небезпечних територій.
       Деякі з них приїхали до нас у дуже важкому стані, інші потребували меншої допомоги. Але кожному ми намагаємося дати необхідне: спокійне середовище, ветеринарний супровід, відновлення, якісний догляд і час.
       Історіями приватних коней ми не ділимося детально - поважаємо приватність їхніх власників. Для нас допомога не закінчується на тих, хто офіційно є підопічним фонду. Якщо кінь потребує безпеки та турботи - ми намагаємося бути поруч.`,
  },

  {
    id: 'licar',
    name: 'Лицар',
    age: 'Рік народження: невідомий',
    status: 'private',
    photo: '/horse-rescue-web/images/licar.jpg',
    heroPhoto: '/horse-rescue-web/images/licar.jpg',
    additionalPhotos: [''],
    shortBio: 'Не всі історії можна розповісти',
    rescueStory:
      `Це приватний кінь, який живе на території нашої ферми разом із підопічними фонду.  
       На нашій фермі живуть не лише коні, які безпосередньо належать фонду. Ми також допомагаємо приватним власникам, чиї коні потребують безпечного місця, відновлення та реабілітації - зокрема тим, кого вдалося вивезти з прифронтових та небезпечних територій.
       Деякі з них приїхали до нас у дуже важкому стані, інші потребували меншої допомоги. Але кожному ми намагаємося дати необхідне: спокійне середовище, ветеринарний супровід, відновлення, якісний догляд і час.
       Історіями приватних коней ми не ділимося детально - поважаємо приватність їхніх власників. Для нас допомога не закінчується на тих, хто офіційно є підопічним фонду. Якщо кінь потребує безпеки та турботи - ми намагаємося бути поруч.`,
  },
  
];

export type CampaignStatus = 'active' | 'completed';

export interface SpendingItem {
  category: string;
  amount: number;
  description: string;
}

export interface CampaignReport {
  summary: string;
  spending: SpendingItem[];
  transactionLinks?: {
    title: string;
    url: string;
  }[];
}

export interface Campaign {
  id: string;
  title: string;
  description: string;
  target: number;
  raised: number;
  status: CampaignStatus;
  startDate: string;
  endDate?: string;
  horses?: string[];
  reportAvailable: boolean;
  report?: CampaignReport;
}

export const campaigns: Campaign[] = [
  {
    id: 'winter-2026',
    title: 'Подаруй коням ситу зиму',
    description:
      `Зима для коней - не лише холод, а й місяці, коли їм особливо потрібні тепло, турбота та достатньо якісного корму. Саме тому ми розпочали збір на 80 тонн сіна (це приблизно 20 машин по 4,5–5 тонн кожна)
      
      Вартість однієї машини сіна разом із доставкою: 34 000 грн.  
      (20 машин * 34 000 грн = 680 000 грн)
      Дві машини ми вже придбали власним коштом, а зараз збираємо на наступні.

      Прогрес:
      - Серпень 2026: 2 машини придбали власним коштом
      - 16 Вересня 2026: назбирали на третю машину, зробили часкове зняття з банки та замовили сіно. Звіт доданий до архіву
      
      Ми хочемо, щоб допомога була взаємною.  
      За донат на сіно ти можеш приїхати до нас на ферму та провести час із кіньми. Познайомитися з ними, погладити, погодувати, побути поруч і відчути особливий зв’язок, який виникає між людиною та конем. Домовитися про зустріч можна з засновницею фонду через Instagram 
      
      Твій внесок - не просто підтримка ферми. Це турбота про тварин і можливість стати частиною їхнього життя.
      Дякуємо кожному, хто долучається!`,
    target: 612000,
    raised: 47012,
    status: 'active',
    startDate: 'Серпень 2026',
    horses: ['kalibri', 'britni', 'bagira', 'furioza', 'leksa', 'vavilon', 'bulan', 'djo', 'lada', 'sparta', 'licar', 'bonya'],
    reportAvailable: false,
  },

 {
    id: 'winter-2026-01',
    title: 'Купівля сіна для коней',
    description:
      `Перший звіт великого збору (Подаруй коням ситу зиму)`,
    target: 34000,
    raised: 34000,
    status: 'completed',
    startDate: 'Серпень 2026',
    endDate: '16 Вересня 2026',
    horses: ['kalibri', 'britni', 'bagira', 'furioza', 'leksa', 'vavilon', 'bulan', 'djo', 'lada', 'sparta', 'licar', 'bonya'],
    reportAvailable: true,
    report: {
      summary:
        "Замовили одну машину сіна разом із доставкою",
      spending: [
      {
          category: 'Купівля сіна та доставка',
          amount: 34000,
          description:
            '',
        },
      ],
      
      transactionLinks: [
          {
            title: 'Підтвердження часткового зняття з банки',
            url: '/horse-rescue-web/images/cino.jpg',
          },
  
  {
    id: 'furioza',
    title: 'Викуп вагітної кобили з бійні',
    description:
      `Вагітна кобила з раною на нозі була викуплена в м’ясника в Березні 2026`,
    target: 45000,
    raised: 51630,
    status: 'completed',
    startDate: '21 Березня 2026',
    endDate: ' ',
    horses: ['furioza', 'leksa'],
    reportAvailable: true,
    report: {
      summary:
        "М’ясник збирався зарізати вагітну кобилу. Засновниця фонду терміново відкрила збір на її викуп. За один день ми зібрали необхідну суму та врятували кобилу",
      spending: [
      {
          category: 'Викуп кобили',
          amount: 45000,
          description:
            '',
        },
        {
          category: 'Вакцинація',
          amount: 3320,
          description:
            '',
        },
        {
          category: 'Корма',
          amount: 3310,
          description:
            '',
        },
       
      ],
      
      transactionLinks: [
          {
            title: 'Підтвердження оплати корму',
            url: '/horse-rescue-web/images/food.jpg',
          },
          {
            title: 'Підтвердження оплати вакцинації',
            url: '/horse-rescue-web/images/vakcina.jpg',
          },
          
        ],
  },},
];
